---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetProperties
source: html/d43bc06b-0699-71d6-95f8-c8bc095d189e.htm
---
# AssetProperties Members

Adds a new connected asset attached to this asset property, if it allows it.